#+PROPERTY: header-args :tangle yes :results output silent

#+name: 70AB9C8D-1A72-4061-9261-B764F88A4666
#+begin_src emacs-lisp :comments no
;; -*- no-byte-compile: t; -*-
#+end_src

**** wrap
     :PROPERTIES:
     :ID:       3379799E-9759-4CF6-9309-AF90E7BC048E
     :END:

#+begin_quote
Mark source block evaluation results
#+end_quote

Inline Source-Blocks are recognizable by their =verbatim= fornt. They
do not interrupt the flow. Source-Blocks are their own entities. They
stand out. Their results possibly need to be visibly noticeably different for
the reader, but wrapping them in an EXAMPLE special block is not the way to go.

#+name: 95104A71-35DA-45F0-89D6-B1EDEB175F05
#+begin_src emacs-lisp
(setq org-babel-default-header-args (assq-delete-all :wrap org-babel-default-header-args:sql))
(setq org-babel-default-header-args (assq-delete-all :wrap org-babel-default-header-args))
#+end_src


Diagramming languges require =RESULTS= output for exporting.

#+name: 56D0261B-CDA0-44EE-82C0-CC122C59116D
#+begin_src emacs-lisp
  (pdc/set-org-babel-default-header-args:ditaa :wrap "RESULTS")
  (pdc/set-org-babel-default-header-args:dot :wrap "RESULTS")
  (pdc/set-org-babel-default-header-args:plantuml :wrap "RESULTS")
#+end_src

#+RESULTS:
#+BEGIN_EXAMPLE
((:wrap . RESULTS) (:results . file) (:exports . results))
#+END_EXAMPLE
